title: DNS Query to Cruciferra Domains
id: be01d25b-1af5-4f97-854e-65c8270c1fc9
status: experimental
description: |
    Auto-generated stub — analyst must validate and tune before deployment.
    Detects DNS queries for domains associated with Cruciferra.
date: 2026-07-21
author: ti-pipeline (auto-generated)
references:
    - https://abuse.ch
tags:
    - adaptixc2
    - agenttesla
    - asyncrat
    - byovd
    - cruciferra
    - crypter-service
    - darkcloud stealer
    - dcrat
    - defense-evasion
    - dll-sideloading
    - edr-tampering
    - formbook
    - malware-as-a-service
    - malware.cruciferra
    - phantom stealer
logsource:
    category: dns
detection:
    selection:
        QueryName|contains:
        - 'almacensantangel.com'
        - 'gatuso.duckdns.org'
        - '0zbqnac1t4dv2t2wuodv1m.com'
        - 'digital-magicians.com'
        - 'fiusyevr.live'
        - 'fvxcuvuyte.live'
        - 'fuaytrwese.love'
        - 'hsauyeet.live'
        - 'jaiydteds.love'
        - 'kdsuyrse.live'
        - 'lisiutegrm.live'
        - 'mksfuuerwo.live'
        - 'ncduuyese.live'
        - 'oakwusya.love'
        - 'paiwudyea.love'
        - 'qeuasytua.love'
        - 'svuatwea.love'
        - 'syfiaydytea.live'
        - 'vusuydryt.love'
        - 'xnbscuya.love'
        - 'xuastyrdqk.love'
    condition: selection
falsepositives:
    - Legitimate services using similar domain patterns
level: medium
