title: Network Connection to Prinz Eugen Infrastructure
id: edf1326a-88ed-44e8-a4fc-6a3fc744ef63
status: experimental
description: |
    Auto-generated stub — analyst must validate and tune before deployment.
    Detects network connections to indicators associated with Prinz Eugen.
date: 2026-06-26
author: ti-pipeline (auto-generated)
references:
    - https://abuse.ch
tags:
    - go-based
    - malware.prinz_eugen
    - prinz eugen
    - remotepc rmm
    - rootboy
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        DestinationHostname|contains:
        - '6cudc5cqa2bjpwdhcwm2lj6dbqejjjqzeo6ipwvmbazr6cgu7vfk3dad.onion'
        - 'stndrdbnk.cc'
        - 'prinzfkbjiazbrur4mjje6mntjc4vydx3iatkkzycufoylqcoo4y7pqd.onion'
        - 'captchafestung.sbs'
        - 'darkempire.fun'
        - 'g-captchafestung.sbs'
        - 'old-pidop.ru'
        - 'festung-e.duckdns.org'
        DestinationIp|contains:
        - '212.80.7.74'
        Initiated: 'true'
    condition: selection
falsepositives:
    - Legitimate traffic to similar-looking domains (review carefully)
level: medium
